# DATA PRE-PROCESSING

### Lab: 10

-   NUMPY
-   PANDAS

______________________

### Pandas

####    DATA TYPES:

-   DATA FRAMES
-   TABLES

#### FEATURES:

-   ENCODING:

        -     LABEL ENCODING
        -     ONE HOT ENCODING

-   INFO
-   DESC
-   MISSING VALUES:     -   FILL    -   DEL ROW

-   DATA SCALING

    -   MIN/MAX SCALING
    -   STANDARD SCALING

__________________

### DATASET PARTITIONS:

1.  TRAINING SET    70%
2.  TESTING SET     30%

________________________________

In [64]:
import pandas as pd
import numpy as np
import os

        Data CSV

In [65]:
data = pd.read_csv('house_price.csv')

        Print head of data

In [66]:
print(data.head())

   Id  Area  Bedrooms  Bathrooms  Floors  YearBuilt  Location  Condition  \
0   1  1360         5          4       3       1970  Downtown  Excellent
1   2  4272         5          4       3       1958  Downtown  Excellent
2   3  3592         2          2       3       1938  Downtown       Good
3   4   966         4          2       2       1902  Suburban       Fair
4   5  4926         1          4       2       1975  Downtown       Fair

  Garage   Price
0     No  149919
1     No  424998
2     No  266746
3    Yes  244020
4    Yes  636056

        Print COLOUMNS

In [67]:
print(data.columns)

Index(['Id', 'Area', 'Bedrooms', 'Bathrooms', 'Floors', 'YearBuilt',
       'Location', 'Condition', 'Garage', 'Price'],
      dtype='object')

        Print DTYPES

In [68]:
print(data.dtypes)

Id            int64
Area          int64
Bedrooms      int64
Bathrooms     int64
Floors        int64
YearBuilt     int64
Location     object
Condition    object
Garage       object
Price         int64
dtype: object

        Print DATA ROWS

In [69]:
data.shape

(2000, 10)

In [70]:
data.info

<bound method DataFrame.info of         Id  Area  Bedrooms  Bathrooms  Floors  YearBuilt  Location  Condition  \
0        1  1360         5          4       3       1970  Downtown  Excellent
1        2  4272         5          4       3       1958  Downtown  Excellent
2        3  3592         2          2       3       1938  Downtown       Good
3        4   966         4          2       2       1902  Suburban       Fair
4        5  4926         1          4       2       1975  Downtown       Fair
...    ...   ...       ...        ...     ...        ...       ...        ...
1995  1996  4994         5          4       3       1923  Suburban       Poor
1996  1997  3046         5          2       1       2019  Suburban       Poor
1997  1998  1062         5          1       2       1903     Rural       Poor
1998  1999  4062         3          1       2       1936     Urban  Excellent
1999  2000  2989         5          1       3       1903  Suburban       Fair

     Garage   Price
0        No  149919
1        No  424998
2        No  266746
3       Yes  244020
4       Yes  636056
...     ...     ...
1995     No  295620
1996    Yes  580929
1997     No  476925
1998    Yes  161119
1999     No  482525

[2000 rows x 10 columns]>

        Describe

In [71]:
data.describe()

,Id,Area,Bedrooms,Bathrooms,Floors,YearBuilt,Price
count,2000.000000,2000.000000,2000.000000,2000.00000,2000.000000,2000.000000,2000.000000
mean,1000.500000,2786.209500,3.003500,2.55250,1.993500,1961.446000,537676.855000
std,577.494589,1295.146799,1.424606,1.10899,0.809188,35.926695,276428.845719
min,1.000000,501.000000,1.000000,1.00000,1.000000,1900.000000,50005.000000
25%,500.750000,1653.000000,2.000000,2.00000,1.000000,1930.000000,300098.000000
50%,1000.500000,2833.000000,3.000000,3.00000,2.000000,1961.000000,539254.000000
75%,1500.250000,3887.500000,4.000000,4.00000,3.000000,1993.000000,780086.000000
max,2000.000000,4999.000000,5.000000,4.00000,3.000000,2023.000000,999656.000000

________________

### HANDLING MISSING DATA

        Data is NUll

In [72]:
data.isnull().sum()

Id           0
Area         0
Bedrooms     0
Bathrooms    0
Floors       0
YearBuilt    0
Location     0
Condition    0
Garage       0
Price        0
dtype: int64

    .fillna
    .dropna

In [73]:
data.dropna()

,Id,Area,Bedrooms,Bathrooms,Floors,YearBuilt,Location,Condition,Garage,Price
0,1,1360,5,4,3,1970,Downtown,Excellent,No,149919
1,2,4272,5,4,3,1958,Downtown,Excellent,No,424998
2,3,3592,2,2,3,1938,Downtown,Good,No,266746
3,4,966,4,2,2,1902,Suburban,Fair,Yes,244020
4,5,4926,1,4,2,1975,Downtown,Fair,Yes,636056
...,...,...,...,...,...,...,...,...,...,...
1995,1996,4994,5,4,3,1923,Suburban,Poor,No,295620
1996,1997,3046,5,2,1,2019,Suburban,Poor,Yes,580929
1997,1998,1062,5,1,2,1903,Rural,Poor,No,476925
1998,1999,4062,3,1,2,1936,Urban,Excellent,Yes,161119
1999,2000,2989,5,1,3,1903,Suburban,Fair,No,482525

### COLUMNS

In [74]:
data['Area']

0       1360
1       4272
2       3592
3        966
4       4926
        ...
1995    4994
1996    3046
1997    1062
1998    4062
1999    2989
Name: Area, Length: 2000, dtype: int64

In [75]:
data['Area'] = data['Area'].fillna(data['Area'].max(),)

#####   INPLACE FUNCTION:
        changes in data is saved in real time 
        jo inplace nahi hota usme changes save nahi hote ustime

### DUPLICATE VALUES

In [76]:
print(data.duplicated().sum())

0

####  drop duplicate values

data.drop_duplicated()

________________

### DATA ENCODING

In [77]:
data.drop(['Id'],axis=1,inplace = True)

In [78]:
data['Age'] = 2025 - data['YearBuilt']

In [79]:
data.head()

,Area,Bedrooms,Bathrooms,Floors,YearBuilt,Location,Condition,Garage,Price,Age
0,1360,5,4,3,1970,Downtown,Excellent,No,149919,55
1,4272,5,4,3,1958,Downtown,Excellent,No,424998,67
2,3592,2,2,3,1938,Downtown,Good,No,266746,87
3,966,4,2,2,1902,Suburban,Fair,Yes,244020,123
4,4926,1,4,2,1975,Downtown,Fair,Yes,636056,50

In [80]:
print(data['Location'].unique())
print(data['Condition'].unique())

['Downtown' 'Suburban' 'Urban' 'Rural']
['Excellent' 'Good' 'Fair' 'Poor']

In [81]:
data['Location'] = data['Location'].map({
    'Downtown': 0,
    'Suburban': 1,
    'Urban': 2
}).fillna(2)  
data['Condition'] = data['Condition'].map({'Excellent': 0, 'Good': 1, 'Fair': 2})
data['Garage'] = data['Garage'].map({'No': 0, 'Yes': 1})

In [82]:
data.head()

,Area,Bedrooms,Bathrooms,Floors,YearBuilt,Location,Condition,Garage,Price,Age
0,1360,5,4,3,1970,0.0,0.0,0,149919,55
1,4272,5,4,3,1958,0.0,0.0,0,424998,67
2,3592,2,2,3,1938,0.0,1.0,0,266746,87
3,966,4,2,2,1902,1.0,2.0,1,244020,123
4,4926,1,4,2,1975,0.0,2.0,1,636056,50

In [83]:
data.drop(['YearBuilt'],axis=1,inplace=True)

In [84]:
data.head()

   Area  Bedrooms  Bathrooms  Floors  Location  Condition  Garage   Price  Age
0  1360         5          4       3       0.0        0.0       0  149919   55
1  4272         5          4       3       0.0        0.0       0  424998   67
2  3592         2          2       3       0.0        1.0       0  266746   87
3   966         4          2       2       1.0        2.0       1  244020  123
4  4926         1          4       2       0.0        2.0       1  636056   50

In [85]:
X = data.drop('Price', axis=1)  
y = data['Price']

In [86]:
y.head()

0    149919
1    424998
2    266746
3    244020
4    636056
Name: Price, dtype: int64

In [87]:
X.head()

   Area  Bedrooms  Bathrooms  Floors  Location  Condition  Garage  Age
0  1360         5          4       3       0.0        0.0       0   55
1  4272         5          4       3       0.0        0.0       0   67
2  3592         2          2       3       0.0        1.0       0   87
3   966         4          2       2       1.0        2.0       1  123
4  4926         1          4       2       0.0        2.0       1   50

### SCIKIT LEARN

### TEST AND TRAINING DATASETS

In [88]:
# from sklearn.preprocessing import OneHoteEncoder
from sklearn.model_selection import train_test_split

In [89]:
print("Data type:", type(data))
print("y type:", type(y))
print("Data is None:", data is None)
print("y is None:", y is None)

Data type: <class 'pandas.core.frame.DataFrame'>
y type: <class 'pandas.core.series.Series'>
Data is None: False
y is None: False

In [96]:
X_train, X_test, y_train, y_test = train_test_split(X, y , test_size = 0.3, random_state=42)

In [97]:
X_train.shape

(1400, 8)

In [98]:
y_train.shape

(1400,)

In [99]:
X_test.shape

(600, 8)

In [100]:
y_test.shape

(600,)